# SchedulableField Class

---
A non-calculated field eligible to be included in a schedule.
SystemObject Autodesk.Revit.DBSchedulableField
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SchedulableField : IDisposable

    Public Class SchedulableField
    	Implements IDisposable

    public ref class SchedulableField : IDisposable

    type SchedulableField =
        class
            interface IDisposable
        end
The SchedulableField type exposes the following members.
| Name| Description
---|---|---
| SchedulableField|  Creates a new SchedulableField.
| SchedulableField(Guid)|  Creates a new SchedulableField.
| SchedulableField(ScheduleFieldType)|  Creates a new SchedulableField.
| SchedulableField(ScheduleFieldType, ElementId)|  Creates a new SchedulableField.
Top
| Name| Description
---|---|---
| FieldType|  The type of data displayed by the field.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ParameterId|  The ID of the parameter displayed by the field.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SchedulableField
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetCustomFieldData|  Gets the data associated with this custom field. If this field isn't a CustomField will return .
| GetHashCode|  Gets the integer value of the SchedulableField as hash code (Overrides ObjectGetHashCode)
| GetName|  Gets the name of the field.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(SchedulableField, SchedulableField)| Determines whether two SchedulableField are the same.
| Inequality(SchedulableField, SchedulableField)| Determines whether two SchedulableField are different.
Top
The SchedulableField class represents a non-calculated field that is eligible to be included in a schedule. A list of fields that can be included in a schedule can be obtained from ScheduleDefinition.GetSchedulableFields.
#### Reference
Autodesk.Revit.DB Namespace